; domain
(define (domain depot)
(:requirements :typing)
(:types 	place locatable driver - object
	depot distributor - place
	truck hoist surface - locatable
	pallet crate - surface
)

(:predicates (at ?x - locatable ?y - place)
	(on ?x - crate ?y - surface)
	(in ?x - crate ?y - truck)
	(clear ?x - surface)
	(lifting ?agent - place ?x - hoist ?y - crate)
	(available ?agent - place ?x - hoist)
	(driving ?agent - driver ?t - truck)
	(dummy-additional-predicate )
)

(:action lift
	:parameters   (?p - place ?x - hoist ?y - crate ?z - surface)
	:precondition (and (at ?y ?p) (on ?y ?z) (available ?p ?x) (clear ?y) (at ?x ?p))
	:effect       (and (clear ?z) (lifting ?p ?x ?y) (not (available ?p ?x)) (not (clear ?y)) (not (at ?y ?p)) (not (on ?y ?z))
))

(:action drop
	:parameters   (?p - place ?x - hoist ?y - crate ?z - surface)
	:precondition (and (clear ?z) (at ?x ?p) (at ?z ?p) (lifting ?p ?x ?y))
	:effect       (and (available ?p ?x) (at ?y ?p) (on ?y ?z) (clear ?y) (not (clear ?z)) (not (lifting ?p ?x ?y))
))

(:action load
	:parameters   (?p - place ?x - hoist ?y - crate ?z - truck)
	:precondition (and (at ?z ?p) (at ?x ?p) (lifting ?p ?x ?y))
	:effect       (and (in ?y ?z) (available ?p ?x) (not (lifting ?p ?x ?y))
))

(:action unload
	:parameters   (?p - place ?x - hoist ?y - crate ?z - truck)
	:precondition (and (in ?y ?z) (at ?z ?p) (available ?p ?x) (at ?x ?p))
	:effect       (and (lifting ?p ?x ?y) (not (in ?y ?z)) (not (available ?p ?x))
))

(:action drive
	:parameters   (?a - driver ?x - truck ?y - place ?z - place)
	:precondition (and (at ?x ?y) (driving ?a ?x))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action dummy-add-predicate-action
	:parameters   (?agent - object)
	:precondition (and )
	:effect       (and (dummy-additional-predicate )
))

(:action dummy-del-predicate-action
	:parameters   (?agent - object)
	:precondition (and )
	:effect       (and (not (dummy-additional-predicate ))
))

)

; problem
(define (problem tiny_problem) (:domain depot)
(:objects
	hoist1 - hoist
	crate13 - crate
	crate9 - crate
	driver1 - driver
	crate3 - crate
	crate4 - crate
	pallet2 - pallet
	crate1 - crate
	crate7 - crate
	truck1 - truck
	crate14 - crate
	crate5 - crate
	pallet0 - pallet
	distributor1 - distributor
	driver0 - driver
	crate6 - crate
	hoist2 - hoist
	crate11 - crate
	crate12 - crate
	hoist0 - hoist
	crate0 - crate
	depot0 - depot
	truck0 - truck
	pallet1 - pallet
	distributor0 - distributor
	crate8 - crate
	crate2 - crate
	crate10 - crate
)(:init
	(at hoist2 distributor1)
	(at pallet1 distributor0)
	(at hoist0 depot0)
	(driving driver0 truck0)
	(at pallet2 distributor1)
	(at hoist1 distributor0)
	(at pallet0 depot0)
	(driving driver1 truck1)
	(in crate14 truck0)
	(in crate13 truck0)
	(in crate7 truck0)
	(in crate6 truck0)
	(at crate8 depot0)
	(on crate8 pallet0)
	(at crate9 distributor0)
	(on crate9 pallet1)
	(at crate1 distributor0)
	(on crate1 crate9)
	(at crate2 distributor0)
	(on crate2 crate1)
	(at crate12 distributor1)
	(on crate12 pallet2)
	(at crate3 distributor1)
	(on crate3 crate12)
	(at crate11 distributor1)
	(on crate11 crate3)
	(clear crate2)
	(available distributor0 hoist1)
	(at truck1 depot0)
	(at crate0 depot0)
	(on crate0 crate8)
	(available depot0 hoist0)
	(at crate5 depot0)
	(clear crate5)
	(on crate5 crate0)
	(at truck0 distributor1)
	(in crate10 truck0)
	(lifting distributor1 hoist2 crate4)
	(clear crate11)
)(:goal (and 
	(clear crate4)
	(on crate0 crate8)
	(on crate1 crate9)
	(on crate12 pallet2)
	(on crate2 crate1)
	(on crate3 crate12)
	(on crate4 crate5)
	(on crate5 crate0)
	(on crate8 pallet0)
	(on crate9 pallet1)
)))

; plan
1. (load distributor1 hoist2 crate4 truck0)
   deleted: (lifting distributor1 hoist2 crate4)
   added: (in crate4 truck0) (available distributor1 hoist2)
   goals met: 8 of 10
2. (drive driver0 truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 8 of 10
3. (unload depot0 hoist0 crate4 truck0)
   deleted: (in crate4 truck0) (available depot0 hoist0)
   added: (lifting depot0 hoist0 crate4)
   goals met: 8 of 10
4. (drop depot0 hoist0 crate4 crate5)
   deleted: (clear crate5) (lifting depot0 hoist0 crate4)
   added: (available depot0 hoist0) (at crate4 depot0) (on crate4 crate5) (clear crate4)
   goals met: 10 of 10
